# read design
read_verilog VSPCore.v

# elaborate design hierarchy
hierarchy -check -top VSPCore

proc; flatten

synth

# mapping logic to gates.
abc -g gates,MUX

# cleanup
clean -purge

stat

# write synthesized design
write_json vsp-core-ruby.json
